documentation/Examples/SimpleDataProvider/Sample_Data_Provider.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.1" jmeter="3.1 r1770033">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group name" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">3</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1494802590000</longProp>
        <longProp name="ThreadGroup.end_time">1494802590000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <org.qamation.jmeter.config.data.provider.SimpleData guiclass="TestBeanGUI" testclass="org.qamation.jmeter.config.data.provider.SimpleData" testname="Simple Data Provider" enabled="true">
          <stringProp name="dataProviderImplClassName">org.qamation.jmeter.config.data.provider.ExcelToDataProviderAdapter</stringProp>
          <stringProp name="dataLabel">DATA</stringProp>
          <stringProp name="filename">D:/QAMATION/documentation/Examples/SimpleDataProvider/Simple_Excel_Data.xlsx</stringProp>
          <boolProp name="resetAtEOF">true</boolProp>
          <stringProp name="shareMode">shareMode.group</stringProp>
        </org.qamation.jmeter.config.data.provider.SimpleData>
        <hashTree/>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">3</stringProp>
        </LoopController>
        <hashTree>
          <org.qamation.jmeter.config.data.provider.SimpleData guiclass="TestBeanGUI" testclass="org.qamation.jmeter.config.data.provider.SimpleData" testname="Simple Data Provider" enabled="true">
            <stringProp name="dataProviderImplClassName">org.qamation.jmeter.config.data.provider.ExcelToDataProviderAdapter</stringProp>
            <stringProp name="dataLabel">DATA1</stringProp>
            <stringProp name="filename">D:/QAMATION/documentation/Examples/SimpleDataProvider/Simple_Excel_Data.xlsx</stringProp>
            <boolProp name="resetAtEOF">true</boolProp>
            <stringProp name="shareMode">shareMode.thread</stringProp>
          </org.qamation.jmeter.config.data.provider.SimpleData>
          <hashTree/>
          <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="true">
            <stringProp name="BeanShellSampler.query">String[] line = vars.getObject(&quot;DATA&quot;);
for (int i=0; i &lt; line.length; i++) {
	log.info(&quot;Data0[&quot;+i+&quot;]: &quot;+line[i]);
}
</stringProp>
            <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
          </BeanShellSampler>
          <hashTree/>
          <BeanShellSampler guiclass="BeanShellSamplerGui" testclass="BeanShellSampler" testname="BeanShell Sampler" enabled="true">
            <stringProp name="BeanShellSampler.query">String[] line = vars.getObject(&quot;DATA1&quot;);
for (int i=0; i &lt; line.length; i++) {
	log.info(&quot;Data1[&quot;+i+&quot;]: &quot;+line[i]);
}
</stringProp>
            <boolProp name="BeanShellSampler.resetInterpreter">false</boolProp>
          </BeanShellSampler>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>